## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.roleassignment-spn-sa.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02/providers/Microsoft.Authorization/roleAssignments/f29fe327-8a75-74b4-8502-14fef396c23b" -> (known after apply)
      ~ name                                   = "f29fe327-8a75-74b4-8502-14fef396c23b" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.roleassignment-spn-sa-2.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02/providers/Microsoft.Authorization/roleAssignments/8187100a-d5b8-d21e-a414-2d105c60f1db" -> (known after apply)
      ~ name                                   = "8187100a-d5b8-d21e-a414-2d105c60f1db" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.roleassignment-spn-sa-3.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02/providers/Microsoft.Authorization/roleAssignments/8477d6d7-d3af-de7b-0ba4-9643e45922c9" -> (known after apply)
      ~ name                                   = "8477d6d7-d3af-de7b-0ba4-9643e45922c9" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.roleassignment-spn-sa-4.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02/providers/Microsoft.Authorization/roleAssignments/a8b6deb1-eb60-04d7-bb94-21f804578e97" -> (known after apply)
      ~ name                                   = "a8b6deb1-eb60-04d7-bb94-21f804578e97" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.roleassignment-spn-sa-5.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02/providers/Microsoft.Authorization/roleAssignments/c34e77c7-104f-c531-0f47-aae85fb5c64b" -> (known after apply)
      ~ name                                   = "c34e77c7-104f-c531-0f47-aae85fb5c64b" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sa.data.azurerm_storage_account.sa-logs-id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account" "sa-logs-id" {
      + access_tier                        = (known after apply)
      + account_kind                       = (known after apply)
      + account_replication_type           = (known after apply)
      + account_tier                       = (known after apply)
      + allow_nested_items_to_be_public    = (known after apply)
      + azure_files_authentication         = (known after apply)
      + custom_domain                      = (known after apply)
      + enable_https_traffic_only          = (known after apply)
      + id                                 = (known after apply)
      + identity                           = (known after apply)
      + infrastructure_encryption_enabled  = (known after apply)
      + is_hns_enabled                     = (known after apply)
      + location                           = (known after apply)
      + name                               = "miszelauditlogne02"
      + nfsv3_enabled                      = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + queue_encryption_key_type          = (known after apply)
      + resource_group_name                = "rg-aztf-logging-prod-ne-02"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + table_encryption_key_type          = (known after apply)
      + tags                               = (known after apply)
    }

  # module.sa.azurerm_storage_account.sa-logs will be updated in-place
  ~ resource "azurerm_storage_account" "sa-logs" {
        id                                = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
        name                              = "miszelauditlogne02"
        tags                              = {}
        # (75 unchanged attributes hidden)

      + customer_managed_key {
          + key_vault_key_id          = "https://kv-aztf-log-prod-ne-03.vault.azure.net/keys/kv-aztf-log-prod-ne-001-kek/85bffbfe9cb5453e9780a982ac8eb7fa"
          + user_assigned_identity_id = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-aztf-log-prod-ne-02"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.
```
</details>